org/understand-programmers.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: 越来越能体会程序员的辛苦
#+DATE: <2020-01-30 Thu>
#+begin_quote
  国泰民安，百姓安居乐业，生活真的很美好啊。------《武林外传》邢捕头
#+end_quote

今天坐在床上，在我支付的范围内，买了一个 3 个月时长的阿里云服务器和两个
1 年时长的域名。总共花了我不到一百大洋，没办法，我很穷。就这还跟同学借了
30。

我一直想有一个自己的博客网站。极为渴望，每当我游荡在大佬的技术博客网站上时，我想着自己有一天一定也要有一个牛逼轰轰的博客网站。自己每天把自己写的东西，发在上面。别提有多爽！

这不，今天我就向前迈进了一小步。我跟着网上建站的教程，一步一步走，有很多让我头疼的问题。没办法，只能一遍又一遍地搜索，验证确认。这个过程中最煎熬的部分是当我满怀期待地找到一个方法，却悲催地发现：这个方法竟然不能解决我的问题。

情绪很是低落，想停止，但是一想到我能有一个博客网站。我立马兴奋起来，再累都不怕，再疲惫也要完成。因为这是我所希望得到的东西。我一定要把它做出来。

今天，可能没有太多时间总结经验了。明天把这个刚开始的过程记录下来，以供后来复盘。

我今天又在床上坐了一整天，尽管是技术需要，但是还是双腿麻木，手脚冰凉。我坐在床上还好，但是也耐不住一直坐长达六七个小时。

我能够预想到以后的工作生活，不是在玩技术，就是在玩技术的路上。可能没有足够的休息时间了。但这一切都是值得的，为了我真心喜欢的事情。但是，没有什么是容易的，不付出点东西我是不会珍惜的。

所以，现在的付出是必须的。加油吧！
